# EGE - шаблоны решения задач  


---  

## 05  

### 20181  

> если в задаче двоичная система счисления
> и требуется найти минимальное N
> то такой шаблон:

```py
for n in range(1, 1_000):  # натуральные начинаются от 1

    b = bin(n)[2:]  # переводим в двоичную СС
    if n%2 == 0:  # если чётное
        b += bin(b.count('1'))[2:]  # добавить кол-во 1 в двоичной записи
    else:
        b = '1' + b + '101'
    r = int(b, 2)  # переводим из двоичной в десятичную

    if r > 350:  # это по условию задачи
        print(n)  # печатаем ответ = 17
        break  # нашли минимум и выходим из цикла
```

> если в задаче требуется найти минимальное N
> то цикл for по N от 1 до большого числа
> если в задаче требуется найти максимальное N
> то цикл for по N от большого числа до 0 с шагом -1
> "до 0", так как правая граница не включена

### 18920  

> если в задаче двоичная система счисления
> и требуется найти максимальное R
> то такой шаблон:

```py
lst = []  # список для всех значений R

for n in range(1, 26):  # по условию 1 ≤ N ≤ 25

    b = bin(n)[2:]
    if n % 2 != 0:
        b = '10' + b + '1'
    else:
        b = '10' + b + '0111'
    r = int(b, 2)

    lst.append(r)  # добавляем очередное R 

print(max(lst))  # максимальное из списка = 1415
```

> если в задаче требуется найти минимум
> то просто функцию max заменяете на min

### 18861  

> если в задаче НЕ двоичная система счисления
> и требуется найти минимальное N, при котором 
> результат работы данного алгоритма будет ...
> то такой шаблон:

```py
def trio(n):  # функция перевода в троичную СС
    if n == 0: return '0'
    res = ''
    while n > 0:
        res = str(n%3) + res
        n //= 3
    return res


for n in range(4, 200):  # по условию n > 3
    
	t = trio(n)  # переводим n в троичную СС
    if t[-2:] == '10':
        t = '2' + t
    else:
        t = '1' + t
    r = int(t, 3)  # из троичной в десятичную
	
    if r > 130:  # это по условию в задаче
        print(n)  # 30
        break
```

> если в задаче другая система счисления
> то в функции число 3 заменяете на другое основание: 5,6,7 и т.д.

---  

## 12  

### 18965  

> если в задаче спрашивается
> Какая строка получится в результате
> то такой шаблон:

```py
s = '6' * 666
while '666' in s or '111' in s:
    
    if '666' in s:
        s = s.replace('66','1',1)
    else:
        s = s.replace('111','6',1)
print(s)  # 1161166
```

### 19244  

> если в задаче спрашивается
> Определите наименьшее значение n, при котором 
> то такой шаблон:

```py
for n in range(4, 10_000):  # 3 < n < 10 000
    
    s = '1' + '2' * n
    while '12' in s or '322' in s or '222' in s:
        
        if '12' in s:
            s = s.replace('12','2',1)  # заменить первое вхождение
        if '322' in s:
            s = s.replace('322','21',1)
        if '222' in s:
            s = s.replace('222','3',1)

    if sum(int(e) for e in s) == 15:  # сумма цифр в строке
        print(n)  # 37
        break  # нашли минимальное n и выходим
```

### 19176  

> если в задаче спрашивается
> сколько  символов  "?" было бы добавлено в процессе замен 
> то такой шаблон:

```py
k = 0  # для учёта кол-ва добавленных символов
s = 200 * '*'
while '****' in s or '???' in s:
    if "****" in s:
        s = s.replace('****', '???', 1)
        k += 3  # добавили 3 символа ?
    s = s.replace('??', '*', 1)
print(k)  # 237
```

---  
